Repository: aboud-masoud/Rewards
Catalog: lib/l10n/app_*.arb
Languages: ar

# email_hint
source: Email
ar: البريد الالكتروني

source: Password
ar: كلمة المرور

# repassword
source: Password Again
ar: كلمة المرور مره اخرى

# name_hint
source: Full Name
ar: الاسم الكامل

# bottom_tabbar_home
source: Home
ar: الرئيسية

# bottom_tabbar_score
source: Score
ar: نقاطي

# bottom_tabbar_rewards
source: Rewards
ar: الجوائز

# bottom_tabbar_profile
source: Profile
ar: حسابي

# checkInternetConnection
source: You have to connect to internet before doing this request, please fix it and try again
ar: يجب عليك الاتصال بالانترنت الرجاء التحقق و المحاوله مره اخرى

# signinButton
source: SIGN IN
ar: تسجيل الدخول

source: Don't have an account?
ar: ليس لديك حساب ؟

source: Sign Up
ar: تسجيل جديد

# login_BiometricMssage_BiometricLoginIsDisabled
source: Biometric login is disabled
ar: تم تعطيل تسجيل الدخول البيومتري

source: Error in Email or password
ar: خطأ في البريد الإلكتروني أو كلمة المرور

source: OR
ar: أو

source: Login Biometric
ar: استخدام البصمه للدخول

source: Submit
ar: ارسال

source: Amwaj Center
ar: مركز أمواج

# amwajCentersubtitle
source: Rehabilitation of Hearing & Speech Disorders
ar: تأهيل اضطرابات السمع والنطق

source: Welcome back!
ar: أهلاً بعودتك !

# loginmessage
source: Login to continue
ar: تسجيل الدخول للمتابعة

source: Already have an account?
ar: هل لديك حساب؟

# loginbutton
source: Sign in
ar: تسجيل الدخول

# stammering
source: Stuttering
ar: التأتأة / اللعثمة

# stammeringdesc
source: Adults or Children Stuttering
ar: اللعثمة الكلامية عند الكبار أو الصغار

# getstart
source: Get Started
ar: ابدأ الآن

source: Language Delay
ar: تأخر لغوي

# languageDelaydesc
source: Delayed language,Speech Disorders,Autism…etc
ar: تأخر لغة ، اضطراب نطقي ، اضطراب التوحد ..الخ

source: Home
ar: الرئيسية

source: Profile
ar: حسابي

source: Rewards
ar: المكافآت

source: Score
ar: مجموعك

# locationAddress
source: Alkhan - Altawwun street - alqema 102 - opposite side of Expo
ar: الخان - شارع التعاون الرئيسي - ١٠٢ - مقابل اكسبو

source: Work Hours
ar: ساعات العمل

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: Monday
ar: الاثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Closed
ar: مغلق

# followus
source: Follow Us on
ar: تابع حساب المركز عبر

source: Identity Information
ar: معلومات الهوية

source: Step
ar: خطوة

source: Case History
ar: تاريخ الحالة

source: Birth and Development History
ar: تاريخ الولادة والنمو

source: Communication
ar: الجانب التواصلي

source: Date of Birth
ar: تاريخ الولادة

source: Nationality
ar: الجنسية

source: Gender
ar: الجنس

source: Address
ar: مكان السكن

source: Used language with the client at home
ar: اللغة الأكثر استخداماً مع الطفل / الشخص في المنزل

source: Mobile Number
ar: رقم الهاتف المحمول

source: Parent's occupation
ar: وظيفة الأب / الأم

# siblingsandhisrank
source: Client’s siblings and his rank
ar: عدد الإخوة وترتيب الطفل / الشخص بين اخوته؟

# siblingsandhisrankexample
source: For example: 2 out of 5 / 3 out of 3
ar: (مثال : 1 من 5 ، 2 من 2 )

source: Is there any kinship between parents?
ar: هل هناك قرابة بين الوالدين؟

source: You found / contact us via
ar: تم التصال بنا عن طريق

source: Save
ar: حفظ

source: Edit Profile
ar: تعديل الملف الشخصي

# clientFullName
source: Client's Full Name*
ar: الاسم الكامل للمستفيد / الطفل

# firstEvaluationDate
source: 1 st Evaluation Date
ar: تاريخ التقييم الأول

# firstTherapeuticDate
source: 1 st Therapeutic Session Date
ar: تاريخ الجلسة العلاجية الأولى

# therapeuticName
source: Therapist Name
ar: اسم الاختصاصي

# tasks
source: Points
ar: عدد النقاط

# apotments
source: Appointments
ar: تحديد موعد

source: Book an
ar: احجز

source: Family Counseling Session
ar: جلسة استشارة للأهل

source: Evaluation Session
ar: جلسة التقييم

# okay
source: Ok
ar: موافق

# apotmentsTitleDialog
source: We received your request successfully!
ar: لقد تلقينا طلبك بنجاح!

# apotmentsDescDialog
source: We will contact you on your registered number within 24 hours
ar: سنتواصل معك على رقمك المسجل خلال 24 ساعة

# complaint
source: What is your complaint? briefly
ar: ما هي الشكوى (الحاليّة) باختصار

# problemFirstNoted
source: When the problem was first noted?
ar: متى تم الانتباه للمشكلة ؟

# speechassessment
source: Does the child have a previous language and speech assessment? What was the Result?
ar: هل تم إجراء تقييم لغوي / نطقي سابقاً .. ما هي نتائجه؟

# diagnosed
source: Has your child been diagnosed with any of these?
ar: هل تم تشخيص الطفل سابقاً بأي من التالي؟ حدد

# disordersfamily
source: Is there any similar language or speech disorders noted in the family?
ar: هل توجد مشكلات مشابهة في الأسرة أو الأقارب ؟

# enrolledpreviously
source: Had your child enrolled previously in any rehabilitation programs (occupational therapy, physical therapy, behavioral modification…)? And how was his/her progress?
ar: هل تلقى الطفل جلسات تأهيل (علاج نطق، علاج وظيفي، تعديل سلوك، ..) سابقاً ؟ وكيف كانت استفادته؟

source: Next
ar: التالي

source: Cancel
ar: إلغاء

source: Camera
ar: كاميرا

source: Galary
ar: معرض الصور

# task
source: Tasks
ar: طرق جمع النقاط

source: Replace Your Points with
ar: استبدل نقاطك بـ

# replacetext
source: REPLACE
ar: استبدل

# youdonthaveenighscore
source: You Don't Have enough Score
ar: ليس لديك ما يكفي من النقاط

# areyousuretitle
source: Are You Sure ?
ar: هل انت متاكد ؟

# areyousurescoremessage
source: Do you want to replace your points with the selected gift ?
ar: هل تريد استبدال نقاطك بالهدية المختارة؟

source: Done
ar: تم

source: Congratulations!
ar: تهانينا!

# pleaseproceedtothereceptionist
source: Please proceed to the receptionist to complete your request.
ar: يرجى التوجه إلى موظف الاستقبال لإكمال طلبك.

# pointshavebeendeducted
source: points have been deducted, and a request to replace them with
ar: تم خصم النقاط وطلب استبدالها

source: has been received.
ar: تم استلام.

source: How does the client communicate most of the time?
ar: كيف يتواصل الشخص / الطفل معظم الوقت؟

source: Describe (in general) clients’ behavior
ar: كيف تصف سلوك الطفل / الشخص (بشكل عام) ؟

source: Describe clients’ focus and attention
ar: كيف تصف قدرة الطفل / الشخص على التركيز والانتباه ؟

source: Would you like to add any additional information?
ar: هل لديك أي معلومات أخرى تحب اضافتها ؟

source: MEDICAL HISTORY
ar: تاريخ طبى

# doestheclientuseanymedicationsregularlyfrequently
source: Does your child use any medications regularly-frequently? Mention.
ar: هل تلقّى / يتلقى الطفل أي علاجات دوائية منتظمة ؟ ما هي

# doestheclienthaveanydifficultiesinvisionhearingoranyothersensationissues
source: Has your child had a vision, hearing problems, or any other sensory issues?
ar: هل يرتدي الطفل أي مُعينات سمعية (سماعات طبية، قوقعة، .. )

source: Preferable hand for the client
ar: اليد المفضلة للمستفيد / الطفل

source: Was the beginning of stuttering symptoms associated with language or speech difficulty?
ar: هل كانت بداية أعراض التأتأة المرتبطة باللغة أو صعوبة الكلام؟

source: Is there any similar speech disorder noted in the family?
ar: هل هناك أي اضطراب في الكلام المماثل الذي لوحظ في الأسرة؟

source: Is stuttering severity change among places/people/situations?
ar: هل تتغير شدة التلعثم بين الأماكن / الأشخاص / المواقف؟

source: STUTTERING HISTORY
ar: تاريخ التأتأة

source: During the stuttering moment, the client or you will
ar: خلال لحظة التأتأة ، العميل أو سوف تفعله

# stutteringsymptomsfirstnoted
source: When were the stuttering symptoms first noted?
ar: متى بدأت أعراض التلعثم / التأتأة بالظهور ؟

# stutteringsymptomsfirstnoted1
source: Since days-weeks
ar: منذ أيام – أسابيع

# stutteringsymptomsfirstnoted2
source: Since 2-6 months
ar: منذ 2 - 6 شهور

# stutteringsymptomsfirstnoted3
source: Since 6 months or more
ar: منذ 6 شهور أو أكثر

# stutteringsymptomsfirstnoted4
source: For more than a year
ar: منذ أكثر من سنة

# lessthan
source: Less than 70%
ar: أقل من 70٪

# morethan
source: 90% or more
ar: 90٪ أو أكثر

source: Landline
ar: الهاتف الارضي

# mobilephone
source: Mobile Number
ar: الهاتف المحمول

# apotmentsTime
source: 15 Min
ar: ١٥ دقيقة

# mobileNumberone
source: Mobile Number 1
ar: رقم هاتف الأب

# mobileNumbertwo
source: Mobile Number 2
ar: رقم هاتف الأم

source: Male
ar: ذكر

source: Arabic
ar: العربية

source: English
ar: الانجليزية

source: Other
ar: أخرى

source: Yes
ar: نعم

source: No
ar: لا

source: Previous experience
ar: معرفة مسبقة

source: Friend
ar: صديق

source: Internet search
ar: الانترنت

source: Advertisements
ar: الاعلانات

# diagnosed1
source: Attention Deficit and Hyperactivity Disorder (ADHD)
ar: اضطراب فرط الحركة ونقص الانتباه ADHD

# diagnosed2
source: Auditory Processing Disorder (APD)
ar: اضطراب المعالجة السمعية APD

# diagnosed3
source: Autism Spectrum Disorder (ASD)
ar: اضطراب طيف التوحد ASD

# diagnosed4
source: General Developmental Delay (GDD)
ar: التأخر النمائي العام GDD

# diagnosed5
source: Mental Retardation (MR)
ar: الاعاقة الذهنية MR

# diagnosed6
source: Hearing Loss (HL)
ar: ضعف سمع HL

# diagnosed7
source: Learning Disabilities (LD)
ar: صعوبات التعلّم LD

source: Birth genre:
ar: نوع الولادة

source: Natural
ar: ولادة طبيعية

source: Cesarean
ar: عملية قيصرية

source: Birth weight
ar: الوزن عند الولادة

# complicationsduringpregnancy
source: Were there any complications during pregnancy or delivery? Explain.
ar: هل كانت هناك أي تعقيدات قبل أو خلال أو بعد الولادة ؟ وضّح ذلك

# childexperienced
source: Has your child experienced any of these?
ar: هل تعرّض الطفل لأي من التالي ؟

# childexperienced1
source: Recurrent Otitis Media/ Ear infection.
ar: التهاب أذن متكرر

# childexperienced2
source: Recurrent tonsillitis
ar: التهاب لوزتين متكرر

# childexperienced3
source: Sinusitis or nasal polyps/growths
ar: جيوب أو ناميات أنفية

# childexperienced4
source: Epileptic seizures
ar: نوبات تشنجية / صرعية

# childexperienced5
source: Mumps
ar: النكاف (أبو دغيم)

# childexperienced6
source: Meningitis
ar: التهاب السحايا

# delaydevelopmental
source: Did your child delay in any of these developmental stages?
ar: هل تأخر الطفل في أي من المراحل التطورية التالية عن الأعمار المذكورة؟

# delaydevelopmentalexample
source: If there is no delay, leave choices unchecked.
ar: إذا لم يكن هناك تأخير ، اترك الخيارات دون تحديد.

# delaydevelopmental1
source: Sitting (4-6 months)
ar: الجلوس ( 4 - 8 شهور)

# delaydevelopmental2
source: Teething (6-10 months)
ar: التسنين (6 - 10 شهر)

# delaydevelopmental3
source: Crawling (8-11 months)
ar: الحبو (8 - 11 شهر)

# delaydevelopmental4
source: Walking (12-18 months)
ar: المشي (12 - 18 شهر)

# delaydevelopmental5
source: Toilet use (two years and a half)
ar: استخدام الحمام (سنتين ونصف)

# skillschildachieves
source: Check the skills, that your child achieves independently
ar: حدد المهارات التي يستطيع الطفل انجازها باستقلالية تامة:

# skillschildachieves1
source: Drink from the cup
ar: الشرب من الكوب

# skillschildachieves2
source: Eat with the spoon
ar: الاكل باستخدام الملعقة

# skillschildachieves3
source: Wear or take off shoes
ar: لبس أو خلع الحذاء

# skillschildachieves4
source: Wear clothes
ar: لبس الثياب

# skillschildachieves5
source: Going up and down the stairs
ar: نزول أو صعود الدرج

# skillschildachieves6
source: Using pencil and coloring pencils
ar: استخدام القلم والألوان

# communicatechildtime
source: How does your child communicate, most of the time?
ar: كيف يتواصل الطفل عادة ؟

# communicatechildtime1
source: Crying and shouting
ar: البكاء أو الصراخ

# communicatechildtime2
source: Hand lead toward places
ar: شد الأشخاص نحو المكان

# communicatechildtime3
source: Signing and body language
ar: لغة اشارة / ايماءات جسدية

# communicatechildtime4
source: Pointing to things he wants
ar: الإشارة للإشياء بالإصبع

# communicatechildtime5
source: Speech - one word
ar: تواصل كلامي - كلمة واحدة

# communicatechildtime6
source: Speech – utterances and sentences
ar: تواصل كلامي - عبارات وجُمل

# childspeech
source: Recently, your child’s speech is:
ar: ما مستوى كلام الطفل (الحالي) ؟

# childspeech1
source: He doesn’t talk
ar: لا يتكلم

# childspeech2
source: Unintelligible speech
ar: كلامه غير مفهوم

# childspeech3
source: Limited words (less than 10 words)
ar: عدد محدود من الكلمات (اقل من 10)

# childspeech4
source: Only single words, no utterances or sentences
ar: مفردات فقط، لا يكوّن جمل وعبارات

# childspeech5
source: Incorrect and not related utterances and sentences
ar: جمل وعبارات غير مترابطة أو خاطئة

# childproducefirstword
source: When your child did produce his first word?
ar: متى انتج الطفل أول كلماته المقصودة ؟

# examplegive
source: Give example.
ar: اذكر مثال

# childutterancesspeech
source: Does the child use any utterances in his speech?
ar: هل يستخدم الطفل تراكيب لغوية وجُمل بكلامه ؟

# receptivelanguage
source: Describe your child’s receptive language
ar: كيف تصف فهم الطفل للكلام (لغته الاستقبالية) ؟

# expressivelanguage
source: Describe your child’s expressive language
ar: كيف تصف انتاج الطفل للكلام (لغته التعبيرية)؟

# behaviorchild
source: Describe your child’s behavior
ar: كيف تصف سلوك الطفل (بشكل عام) ؟

# focusattention
source: Describe your child’s focus and attention
ar: كيف تصف قدرة الطفل على التركيز والانتباه ؟

# pretendingexample
source: For example: pretending to feed a doll, combing doll hair, and hide and seek.
ar: على سبيل المثال: التظاهر بإطعام دمية ، وتمشيط شعر الدمية ، والاختباء والبحث.

# shareplaysymbolic
source: Describe your child’s play, share activities, symbolic play and role play
ar: كيف تصف قدرة طفلك على اللعب التشاركي و الرمزي و التمثيلي ؟

# bestreinforcements
source: What are your child’s best reinforcements?
ar: ما هي أفضل معززات الطفل وألعابه المفضلة؟

# childTV
source: How much time your child spends on TV/ smart devices?
ar: ما معدل الوقت اليومي الذي يقضيه الطفل بمشاهدة التلفاز أو الأجهزة اللوحية؟

# childTV1
source: Less than 1 hour a day
ar: أقل من ساعة

# childTV2
source: 1-2 hours a day
ar: من ساعة إلى ساعتين

# childTV3
source: 2-4 hours a day
ar: من ساعتين إلى أربع ساعات

# childTV4
source: More than 4 hours a day
ar: أكثر من أربع ساعات يومياً

# childTV5
source: He doesn’t watch TV or smart devices
ar: لا يشاهد التلفاز ولا الأجهزة اللوحية

# stutteringsymptomscontinued
source: Were the stuttering symptoms continued, consistent, or changed with time?
ar: هل كانت أعراض التأتأة مستمرة منذ بداية ظهورها الى الآن؟

# stutteringsymptomscontinued1
source: Disappear for days and weeks
ar: هناك فترات (أيام أو اسابيع) خالية من أعراض التأتأة.

# stutteringsymptomscontinued2
source: Disappear for a few hours during the day
ar: هناك ساعات خلال اليوم خالية من أعراض التأتأة

# checkall
source: Check all that apply
ar: يمكنك تحديد اكثر من اختيار

# stutteringnotedclientspeech
source: What are the noted stuttering behaviors in the client’s speech:
ar: ما هي أعراض اللعثمة / التأتأة الموجودة حالياً؟

# stutteringnotedclientspeech1
source: Sound / syllable repetition, for example: (ca ca car/ b b big)
ar: تكرار جزء أو صوت من الكلمة. (مثال: كـ كـ كـان، سيـ سيـ سيـارة)

# stutteringnotedclientspeech2
source: Sound prolongation, for example: (Sssstreet)
ar: إطالة صوت من الكلمة. (مثال: شـــــــــــــامبو)

# stutteringnotedclientspeech3
source: Block, for example: stop or inaudible prolongation before the word (----Big)
ar: الحبسة الصوتية (مثال: توقف أو مد صامت قبل كلمة بطاطا)

# stutteringnotedclientspeech4
source: Whole word/phrase repetition, for example (then, then, then I say)
ar: تكرار كامل الكلمة أو العبارة. (مثال: بعدين بعدين بعدين رحنا)

# stutteringnotedclientspeech5
source: Interjections, for example: ( mm, I told you that, eee mmm, you have to)
ar: مدخلات صوتية غير لازمة. (مثال إممم وحكيت لبابا امم بدي العب)

# stutteringnotedclientspeech6
source: Revisions, for example: (I wa, I wa, I need water)
ar: مراجعات. (مثال: جلسـ جلسـ قعدت عالكرسي)

# behaviorsassociated
source: Are any of these behaviors associated with the stuttering moment
ar: هل يترافق مع لحظات التأتأة أي من التالي؟ (حدد)

# behaviorsassociated1
source: Distracting sounds, (noisy breathing, clicking sounds)
ar: الأصوات المشتتة للانتباه (التنفس المزعج ، أصوات النقر)

# behaviorsassociated2
source: Facial grimaces, (jaw jerking, lip pressing, eye blinking)
ar: ارتجاف الفك أو ترميش العينين أو تحرك الحاجبين او شد الشفاه

# behaviorsassociated3
source: Head movements
ar: حركات في الرأس

# behaviorsassociated4
source: Movement of extremities (arm movement, leg movement, foot tapping)
ar: حركات جسدية باليدين أو الأرجل أو الكتفين

# stutteringmomentsbehaviorsclient
source: Are the stuttering moments / behaviors that the client experience seems:
ar: كيف تبدو لحظات / سلوكيات اللعثمه عند حدوثها !

# stutteringmomentsbehaviorsclient1
source: Easy and loose
ar: لعثمات سهلة

# stutteringmomentsbehaviorsclient2
source: Hard and tense
ar: لعثمات يرافقها جهد

# notemomentsstuttering
source: As you note, the stuttering moments in clients’ speech appear on:
ar: هل تظهر اللعثمات غالبا في:

# notemomentsstuttering1
source: First sound on the words
ar: بداية الكلمات

# notemomentsstuttering2
source: First word of the sentence
ar: بداية الجمل

# notemomentsstuttering3
source: Middle sound of the word
ar: وسط الكلمات

# notemomentsstuttering4
source: Middle words of sentences
ar: وسط الجمل

# stutteringmomentmoment
source: During the stuttering moment, the client - you will
ar: عند حدوث لحظة اللعثمه :

# stutteringmomentmoment1
source: Continue speaking until the idea is completed
ar: يكمل الشخص / الطفل الكلام

# stutteringmomentmoment2
source: Stop talking and avoid speaking again
ar: يمتنع الشخص / الطفل عن الكلام

# stutteringmomentmoment4
source: Escape from the social situation
ar: ينسحب الشخص / الطفل من الموقف الاجتماعي

# stutteringseverityamong
source: Is stuttering severity change among places/people/situations?
ar: هل تتغير حدة التأتأة بتغير المواقف/ الأشخاص / الأماكن؟

source: Maybe
ar: ربما

# similardisorderspeech
source: Is there any similar speech disorder noted in the family?
ar: هل توجد مشكلات نطقية مشابهة في الأسرة أو الأقارب ؟

# stutteringsymptomsassociatedlanguage
source: Was the beginning of stuttering symptoms associated with language or speech difficulty?
ar: هل كان يوجد صعوبات نطقية او لغوية عند بداية ظهور اللعثمة ؟

# handclient
source: Preferable hand for the client:
ar: اليد المفضلة:

source: Right
ar: اليمنى

source: Left
ar: اليسرى

source: Both
ar: كلتا اليدين

# doesclientmedications
source: Does the client use any medications regularly-frequently? Mention please.
ar: هل تلقّى / يتلقى الطفل / الشخص أي علاجات دوائية منتظمة ؟ ما هي

# doesclientdifficulties
source: Does the client have any difficulties in vision, hearing, or any other sensation issues? Mention please.
ar: هل لدى الطفل / الشخص أي صعوبات في السمع ؟ أو مشكلات حسية أخرى ؟

# howdoestheclientcommunicatemostofthetime1
source: Facial expressions
ar: إيماءات وتعبيرات وجهية

# howdoestheclientcommunicatemostofthetime2
source: Short sentences (1-3) words
ar: جمل قصيرة من كلمة - 3 كلمات

# howdoestheclientcommunicatemostofthetime3
source: Long utterances and sentences
ar: عبارات وجمل طويلة

# preferredtreatmentsessions
source: Which time you are preferred for your treatment sessions :
ar: ما هي الفتره الأنسب لكم لحضور الجلسات الدوريه

# preferredevaluationsession
source: Which day/days you are preferred for your evaluation session:
ar: ما هو اليوم او الأيام الأنسب لكم لحضور جلسة التقييم
